# POSTTEST2

*#Import pandas package*

In [2]:
import pandas as pd

*#jumlah record, nama attribute, jumlah attribute dengan tipe objek, jumlah attribute dengan tipe angka, jumlah attribute yang memiliki nilai null.*

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12600 entries, 0 to 12599
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   RecordID               12600 non-null  int64
 1   Country                12600 non-null  object
 2   Gender                 12600 non-null  object
 3   Demographics Question  12600 non-null  object
 4   Demographics Response  12600 non-null  object
 5   Question               12600 non-null  object
 6   Survey Year            12600 non-null  object
 7   Value                  11187 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 787.6+ KB

*#rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.*

In [11]:
df.describe()

           RecordID         Value
count  12600.000000  11187.000000
mean     210.500000     19.762537
std      121.248024     16.986437
min        1.000000      0.000000
25%      105.750000      6.200000
50%      210.500000     14.900000
75%      315.250000     29.200000
max      420.000000     86.900000

*#first 10 records with numeric dtype*

In [17]:
df["Value"].head(10)

0     NaN
1    10.1
2    13.7
3    13.8
4    13.8
5    17.0
6    17.3
7    18.0
8    18.1
9    18.2
Name: Value, dtype: float64

In [19]:
df[["Value", "RecordID"]].head(10)

   Value  RecordID
0    NaN         1
1   10.1         1
2   13.7         1
3   13.8         1
4   13.8         1
5   17.0         1
6   17.3         1
7   18.0         1
8   18.1         1
9   18.2         1

*#simpan dataset ke dalam file CSV*

In [20]:
df.to_csv("Violence_againstWomen.csv", index=False)

# Praktek

*#Read data yang ada di file, lalu output 5 data teratas*

In [5]:
df = pd.read_csv("Violence Against Women Girls Data.csv")
df.head(5)

,RecordID,Country,Gender,Demographics Question,Demographics Response,Question,Survey Year,Value
0,1,Afghanistan,F,Marital status,Never married,... if she burns the food,01/01/2015,NaN
1,1,Afghanistan,F,Education,Higher,... if she burns the food,01/01/2015,10.1
2,1,Afghanistan,F,Education,Secondary,... if she burns the food,01/01/2015,13.7
3,1,Afghanistan,F,Education,Primary,... if she burns the food,01/01/2015,13.8
4,1,Afghanistan,F,Marital status,"Widowed, divorced, separated",... if she burns the food,01/01/2015,13.8

*#output 5 data terakhir*

In [6]:
df.tail(5)

,RecordID,Country,Gender,Demographics Question,Demographics Response,Question,Survey Year,Value
12595,210,Zimbabwe,M,Residence,Urban,... if she goes out without telling him,01/01/2015,11.8
12596,280,Zimbabwe,M,Residence,Rural,... if she neglects the children,01/01/2015,20.1
12597,280,Zimbabwe,M,Residence,Urban,... if she neglects the children,01/01/2015,15.0
12598,350,Zimbabwe,M,Residence,Rural,... if she refuses to have sex with him,01/01/2015,7.2
12599,350,Zimbabwe,M,Residence,Urban,... if she refuses to have sex with him,01/01/2015,3.7

*#banyak baris dan kolom*

In [8]:
df.shape

(12600, 8)

*#jumlah data pada label "Gender"*

In [12]:
df["Gender"].value_counts()

F    6300
M    6300
Name: Gender, dtype: int64

In [13]:
df["Gender"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 12600 entries, 0 to 12599
Series name: Gender
Non-Null Count  Dtype
--------------  -----
12600 non-null  object
dtypes: object(1)
memory usage: 98.6+ KB